# Лаб 1. Задание 1. Вариант 8

# Дан список A = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]. Вычислите следующие
# срезы: A[:], A[0:len(A)], A[2:5], A[:5], A[2:], A[-3:-1], A[::1], A[::2],

# A[::-1], A[::-2], A[-3:-7:-1], A[7:3:-1]. Проверьте вычисления про-
# граммным путем.

A = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

print("A[:]", A[:])
print("A[0:len(A)]", A[0:len(A)])
print("A[2:5]", A[2:5])
print("A[:5]", A[:5])
print("A[2:]", A[2:])
print("A[-3:-1]", A[-3:-1])
print("A[::1]", A[::1])
print("A[::2]", A[::2])
print("A[::-1]", A[::-1])
print("A[::-2]", A[::-2])
print("A[-3:-7:-1]", A[-3:-7:-1])
print("A[7:3:-1]", A[7:3:-1])